# language:zh-CN  
@YFNA
功能:首页功能查看 
  为了使用首页上面出现的功能链接
  作为一名访客
  我希望点击首页上面的功能链接后页面都能显示正常

#########频道页
@regression
 @YFIA001
场景:积分兑换
  假如 我进入首页
  当   我点击积分兑换按钮
  那么 我应该正确进入积分兑换频道页

@regression
@YFIA001
场景:早市夜市
  假如 我进入首页
  当   我点击早市夜市按钮
  那么 我应该正确进入早市夜市频道页

#### 需在线上测试
@regression
@YFIA001
场景:生活服务
  假如 我进入首页
  当   我点击生活服务按钮
  那么 我应该正确进入生活服务频道页

@regression  
@YFIA001  
场景:一号商城
  假如 我进入首页
  当   我点击一号商城按钮
  那么 我应该正确进入一号商城频道页

@regression  
@YFIA001
场景:掌上一号店
  假如 我进入首页
  当   我点击掌上一号店按钮
  那么 我应该正确进入掌上一号店频道页

@regression 
@YFIA001 
场景:一号药网
  假如 我进入首页
  当   我点击一号药网按钮
  那么 我应该正确进入一号药网频道页

@YFIA001
场景:一号医网
  假如 我进入首页
  当   我点击一号医网按钮
  那么 我应该正确进入一号医网频道页

@regression
@YFIA001 
场景:一号团
  假如 我进入首页
  当   我点击一号团按钮
  那么 我应该正确进入一号团频道页

@regression  
@YFIA001
场景:一页购
  假如 我进入首页
  当   我点击一页购按钮
  那么 我应该正确进入一页购频道页
   
 @YFIA002
场景:首页关键字搜索
  假如 我进入首页
  当   我点击搜索边框右边的热门搜索关键字
  那么 我能正确进入到相应的搜索页面

@YFIA005
场景:首页所有商品分类
  假如 我进入首页
  当   我点击所有商品分类按钮
  那么 我应该正确进入所有商品分类页面
  

